# https://github.com/Homebrew/brew/blob/master/docs/Brew-Bundle-and-Brewfile.md#advanced-brewfiles

cask_args appdir: "/Applications"

# https://starship.rs/guide/#prerequisites
# https://github.com/ryanoasis/nerd-fonts/blob/master/readme_ja.md#%E3%81%9D%E3%81%AE-4-homebrew-fonts
cask "font-hack-nerd-font"

brew "bat"
brew "duckdb"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
brew "mise"
brew "ripgrep"
brew "starship"
brew "tailscale"
brew "zsh-autocomplete"

cask "amical"
cask "appcleaner"
cask "bluesnooze"
cask "claude-code"
cask "google-chrome"
cask "google-drive"
cask "orbstack"
cask "slack"
cask "tableplus"
cask "visual-studio-code"

# Klack
# Nani
