cask_args appdir: "/Applications"

# ターミナルをカスタマイズするために必要なものたち
brew "bat"
brew "exa"
brew "fzf"
brew "ripgrep"
brew "starship"

# 開発に必要なツールたち
brew "docker"
cask "docker"
cask "google-chrome"
cask "postman"
cask "sequel-ace"
cask "visual-studio-code"

# チャットツールたち
# cask "discord"
cask "slack"
cask "zoomus"

# App Store でしかインストールできないツールたち
brew "mas"
mas "LINE", id: 539883307
