cask_args appdir: "/Applications"

# ターミナルをカスタマイズするために必要なものたち
brew "bat"
brew "exa"
brew "fzf"
brew "ripgrep"
brew "starship"

# 開発に必要なツールたち
brew "anyenv"
cask "clipy"
cask "cmd-eikana"
brew "direnv"
brew "docker"
cask "docker"
brew "git"
brew "git-delta"
cask "google-chrome"
brew "httpie"
cask "postman"
# cask "sequel-ace"
cask "tableplus"
cask "visual-studio-code"

# チャットツールたち
# cask "discord"
cask "slack"
cask "zoom"

# App Store でしかインストールできないツールたち
brew "mas"
mas "LINE", id: 539883307
