2754github.client-component-highlighter
3w36zj6.textlint
bierner.markdown-mermaid
bradlc.vscode-tailwindcss
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
esbenp.prettier-vscode
github.copilot
github.copilot-chat
golang.go
gruntfuggly.todo-tree
hediet.vscode-drawio
intellsmi.comment-translate
ms-ceintl.vscode-language-pack-ja
naumovs.color-highlight
oderwat.indent-rainbow
redhat.vscode-yaml
ritwickdey.liveserver
ryu1kn.partial-diff
sirtori.indenticator
stivo.tailwind-fold
streetsidesoftware.code-spell-checker
usernamehw.errorlens
vitest.explorer
wix.vscode-import-cost
yusukehirao.vscode-markuplint
yzhang.markdown-all-in-one
